app/controllers/category_controller.rb

SELECT "entries".* FROM "entries" WHERE (category LIKE '%Food%' AND cast(user_id as text) LIKE '%2%' AND cast(date as text) >= '%1991/11-01%' And cast(date as text) <= '%1991/11-31%')
---
    def index

        if params[:category]
            if params[:month] && params[:month] != ""
                @d = params[:month].split
                if !params[:year]
                    params[:year] = Date.today.year
                end
                @entry = Entry.where('category LIKE ? AND cast(user_id as text) LIKE ? AND cast(date as text) >= ? And cast(date as text) <= ?',
                "%#{params[:category]}%", "%#{session[:user_id]}%", "%#{ params[:year] + "/" + @d[0]}%", "%#{ params[:year] + "/" + @d[1]}%")