app/controllers/home_controller.rb

SELECT "entries".* FROM "entries" WHERE (cast(user_id as text) LIKE '%2%' AND cast(date as text) >= '%2019/01-01%' And cast(date as text) <= '%2019/01-31%')
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index

    if params[:month] && params[:month] != ""
        @d = params[:month].split
        if !params[:year] || params[:year] == ""
            params[:year] = Date.today.year.to_s
        end
        @entry = Entry.where('cast(user_id as text) LIKE ? AND cast(date as text) >= ? And cast(date as text) <= ?',
                            "%#{session[:user_id]}%", "%#{ params[:year] + "/" + @d[0]}%", "%#{ params[:year] + "/" + @d[1]}%")
        @total =  Entry.where('cast(user_id as text) LIKE ? AND cast(date as text) >= ? And cast(date as text) <= ?',
        "%#{session[:user_id]}%", "%#{ params[:year] + "/" + @d[0]}%", "%#{ params[:year] + "/" + @d[1]}%").sum(:amount)
    else
    @entry = Entry.where('cast(user_id as text) LIKE ?', "%#{session[:user_id]}%")

INSERT INTO "entries" ("location", "category", "amount", "date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["location", "Lucky 7"], ["category", "Food"], ["amount", 5.0], ["date", "2019-08-08"], ["created_at", "2019-08-15 03:09:38.186938"], ["updated_at", "2019-08-15 03:09:38.186938"], ["user_id", 2]]
---
  def create

      @entry = Entry.new(entry_params)
      @entry.user_id = session[:user_id]
      if(@entry.save)

SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "entries" SET "date" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["date", "2019-08-14"], ["updated_at", "2019-08-15 02:50:37.804003"], ["id", 16]]
---
  def update
      @entry = Entry.find(params[:id])
      if(@entry.update(entry_params))