app/controllers/location_controller.rb

    def index
        if params[:location] && params[:location] != ""
            if params[:month] && params[:month] != ""
                @d = params[:month].split
                if !params[:year]
                    params[:year] = Date.today.year
                end
                @entry = Entry.where('location LIKE ? AND cast(user_id as text) LIKE ? AND cast(date as text) >= ? And cast(date as text) <= ?',
                "%#{params[:location]}%", "%#{session[:user_id]}%", "%#{ params[:year] + "/" + @d[0]}%", "%#{ params[:year] + "/" + @d[1]}%")
---
SELECT "entries".* FROM "entries" WHERE (location LIKE '%applebee''s%' AND cast(user_id as text) LIKE '%2%' AND cast(date as text) >= '%1991/11-01%' And cast(date as text) <= '%1991/11-31%')